{
    "events": {

        "-1191014010": {
            "year": 740,
            "desc": "Battle of Akroinon. Byzantines win their first large-scale victory in a pitched battle against the Arabs."
        },
        "608890527": {
            "year": 750,
            "desc": "The last Umayyad Caliph Marwan II is overthrown and executed by the first Abbasid Caliph, Abu al-Abbas al-Saffah. The Caliphate is moved to Baghdad which would later develop into a centre of"
        },
        "-1158041435": {
            "year": 208,
            "desc": "The Chinese naval Battle of Red Cliffs occurs."
        },
        "803204672": {
            "year": 454,
            "desc": "Battle of Nedao. Germanic tribes destroy the main Hun army and do away with the Hun domination."
        },
        "-1611547797": {
            "year": 453,
            "desc": "Death of Attila. The Hun Empire is divided between Atilla's sons."
        },
        "1504676509": {
            "year": 698,
            "desc": "Active but unofficial anti-Christian persecution begins in China"
        },
        "-776644895": {
            "year": 413,
            "desc": "St. Augustine, Bishop of Hippo, begins to write The City of God."
        },
        "36055228": {
            "year": 712,
            "desc": "Liutprand, King of the Lombards begins his reign (until 744)."
        },
        "-427322957": {
            "year": 258,
            "desc": "Valerian's massacre of Christians."
        },
        "-1759496476": {
            "year": 234,
            "desc": "Zhuge Liang dies of illness at the standoff of Wuzhang Plains."
        },
        "-312286961": {
            "year": 406,
            "desc": "The eastern frontier of the Western Roman Empire collapses as waves of Suebi, Alans and Vandals cross the then frozen river Rhine near Mainz and enter Gaul."
        },
        "613383735": {
            "year": 522,
            "desc": "Byzantines obtain silkworm eggs and begin silkworm cultivation"
        },
        "-701208904": {
            "year": 161,
            "desc": "First Roman-Parthian War"
        },
        "-15042692": {
            "year": 260,
            "desc": "Roman Emperor Valerian I is taken captive by Shapur I of Persia."
        },
        "367090113": {
            "year": 681,
            "desc": "Bulgaria is recognized as independent country by the Byzantine Empire."
        },
        "-1694542370": {
            "year": 532,
            "desc": "Nika riots in Constantinople; the cathedral is destroyed. They are put down a week later by Belisarius and Mundus; up to 30,000 people are killed in the Hippodrome."
        },
        "1636612049": {
            "year": 189,
            "desc": "The End of the Han dynasty in China."
        },
        "1874704224": {
            "year": 629,
            "desc": "The Byzantine-Arab Wars begin. Much of the Roman Empire is conquered by Muslim Arabs led by Khalid ibn al-Walid."
        },
        "429827350": {
            "year": 570,
            "desc": "Birth of the Islamic prophet, Muhammad."
        },
        "984078061": {
            "year": 452,
            "desc": "The Metropolis of Aquileia is destroyed by Attila the Hun and his army."
        },
        "-1674147196": {
            "year": 306,
            "desc": "Constantine the Great, ends persecution of Christians in the Roman Empire and Constantinople becomes new seat of government for the Roman Empire."
        },
        "-1815859576": {
            "year": 622,
            "desc": "Islam begins in Arabia, the Quran is documented."
        },
        "-767612520": {
            "year": 566,
            "desc": "Birth of Lǐ Yuān, founder of the Tang Dynasty and Emperor of China under the name of Gaozu (618-626)"
        },
        "-2087165047": {
            "year": 800,
            "desc": "Beginning of the ancient West African state of Takrur or Tekrour, which flourished roughly parallel to the Ghana Empire."
        },
        "16165968": {
            "year": 616,
            "desc": "Aethelfrith of Northumbria defeats the Welsh in a battle at Chester in England."
        },
        "-929880565": {
            "year": 639,
            "desc": "Unsuccessful revolt of Ashina Jiesheshuai of the Turkic people against Tang China."
        },
        "1276733160": {
            "year": 132,
            "desc": "Chinese chronicles described the existence of diplomatic relations between Java and China."
        },
        "-1710490531": {
            "year": 606,
            "desc": "Boniface elected papal successor on the death of Pope Sabinian. He sought and obtained a decree from Byzantine Emperor Phocas which stated that \\\"the See of Blessed Peter the Apostle should be the head of all the Churches\"."
        },
        "-1092553315": {
            "year": 41,
            "desc": "Rachias, an ambassador sent from Sri Lanka arrives at the court of Claudius (the Roman Emperor)."
        },
        "-1905638629": {
            "year": 587,
            "desc": "Reccared, king of the Visigoths in Spain, converts to Catholicism."
        },
        "1628859844": {
            "year": 705,
            "desc": "Justinian II is forced to give the title Caesar of Byzantium to the Bulgarian Emperor Tervel. The Byzantine Empire begins to pay annual tributes to Bulgaria."
        },
        "1409519012": {
            "year": 455,
            "desc": "Vandals sack Rome."
        },
        "-109860667": {
            "year": 726,
            "desc": "Byzantine Emperor Leo III the Isaurian destroys the icon of Christ above the Chalke Gate in the capital city of Constantinople, beginning the first phase of the Byzantine Iconoclasm."
        },
        "865947602": {
            "year": 220,
            "desc": "The Han Dynasty comes to an end with establishment of the Three Kingdoms in ancient China."
        },
        "-1985126973": {
            "year": 569,
            "desc": "Nubian kingdom of Makuria converts to Christianity."
        },
        "-1629539318": {
            "year": 626,
            "desc": "The Avars and the Persians jointly besiege but fail to capture Constantinople."
        },
        "1515146284": {
            "year": 9,
            "desc": "Wang Mang temporarily overthrew the Han dynasty of China."
        },
        "118322733": {
            "year": 79,
            "desc": "Pompeii and Herculaneum destroyed by eruption of Mount Vesuvius."
        },
        "426851991": {
            "year": 772,
            "desc": "Charlemagne invades what is now northwestern Germany, battling the Saxons for more than thirty years and finally crushing their rebellion, incorporating Saxony into the Frankish Empire and the Christian"
        },
        "-949478503": {
            "year": 490,
            "desc": "Battle of Mount Badon. According to legend, British forces led by Arthur defeated the invading Saxons."
        },
        "-279378469": {
            "year": 590,
            "desc": "Gregory the Great succeeds Pope Pelagius II (who dies of plague) as the 64th pope."
        },
        "327681048": {
            "year": 680,
            "desc": "Battle of Karbala took place near Kufa, which resulted in the death of Husayn ibn Ali and the division of Muslim community."
        },
        "-434158466": {
            "year": 588,
            "desc": "Shivadeva ascends the throne of the Lichchhavi dynasty in Nepal."
        },
        "1950655437": {
            "year": 569,
            "desc": "Nubian kingdom of Alodia converts to Christianity."
        },
        "-637160434": {
            "year": 649,
            "desc": "Chinese Emperor Gaozong permits establishment of Christian monasteries in each of 358 prefectures."
        },
        "1647706807": {
            "year": 683,
            "desc": "The Second Islamic tribal war."
        },
        "596363255": {
            "year": 114,
            "desc": "A war with Parthia results in Armenia and Mesopotamia being temporarily annexed into the Roman Empire."
        },
        "-1628909569": {
            "year": 184,
            "desc": "The Yellow Turban Rebellion of the Han Dynasty in China begins."
        },
        "1412017276": {
            "year": 537,
            "desc": "Battle of Camlann, final battle of legendary King Arthur."
        },
        "-1825401493": {
            "year": 165,
            "desc": "The Antonine Plague in Rome."
        },
        "374260903": {
            "year": 64,
            "desc": "Great Fire of Rome, first Roman mass Persecution of Christians, earliest significant recognition of Christians in Rome."
        },
        "-1523487506": {
            "year": 638,
            "desc": "Muslim conquest of Palestine."
        },
        "2100556999": {
            "year": 224,
            "desc": "Ardashir I of the Sassanid dynasty conquers the Parthian empire at the Battle of Hormozdg."
        },
        "1500211975": {
            "year": 639,
            "desc": "Muslim conquest of Egypt and Armenia."
        },
        "760304611": {
            "year": 486,
            "desc": "Clovis defeats Syagrius and conquers the last free remnants of the Western Roman Empire."
        },
        "1494013263": {
            "year": 2,
            "desc": "First census of China, the census is one of the most accurate in Chinese history."
        },
        "1714641986": {
            "year": 705,
            "desc": "Overthrow of Empress Wu Zetian, the reign of China's first and only sole-ruling empress ends."
        },
        "1927860278": {
            "year": 708,
            "desc": "The Bulgarians defeat Justinian II at the battle of Anchiallus. Arab armies occupied Sindh."
        },
        "865312908": {
            "year": 785,
            "desc": "Chinese geographer Jia Dan describes large lighthouse pillars built in the Persian Gulf, which is confirmed a century later by al-Mas'udi and al-Muqaddasi."
        },
        "-1255619784": {
            "year": 132,
            "desc": "Bar Kokhba's revolt against Rome."
        },
        "-14768377": {
            "year": 552,
            "desc": "Buddhism introduced to Japan from Baekje during the Asuka period."
        },
        "-1578889932": {
            "year": 618,
            "desc": "The Chenla kingdom completely absorbed Funan."
        },
        "-1824729839": {
            "year": 577,
            "desc": "China's Chen Dynasty invents matches."
        },
        "346413195": {
            "year": 757,
            "desc": "King Offa of Mercia becomes dominant ruler in England."
        },
        "-33461833": {
            "year": 280,
            "desc": "The Jin Dynasty reunites China under one empire after the conquest of Eastern Wu. The Kingdomof Aksum emerges."
        },
        "-477153791": {
            "year": 280,
            "desc": "The Jin Dynasty reunites China under one empire after the conquest of Eastern Wu."
        },
        "-2039804776": {
            "year": 616,
            "desc": "Shah Chosroes II invades Egypt."
        },
        "558013047": {
            "year": 627,
            "desc": "Emperor Heraclius defeats the Persians, ending the Roman-Persian Wars."
        },
        "108553429": {
            "year": 410,
            "desc": "Rome ransacked by the Visigoths led by King Alaric."
        },
        "-1814105179": {
            "year": 451,
            "desc": "Council of Chalcedon, the fourth ecumenical council which taught Jesus Christ as one divine person in two natures."
        },
        "1102107364": {
            "year": 694,
            "desc": "Hispano-Visigothic king Egica accuses the Jews of aiding the Muslims, and sentences all Jews to slavery."
        },
        "2005637372": {
            "year": 600,
            "desc": "Smallpox spreads from India into Europe."
        },
        "-154658614": {
            "year": 70,
            "desc": "Tacitus mentions the Suiones, who will one day be called the Swedes."
        },
        "-657316749": {
            "year": 430,
            "desc": "The Ilopango volcano erupts, thereby devastating the Mayan cities in present-day El Salvador."
        },
        "424216983": {
            "year": 800,
            "desc": "On Christmas Day, Charlemagne is crowned the first Holy Roman Emperor by Pope Leo III."
        },
        "985179459": {
            "year": 244,
            "desc": "Battle of Xingshi in China. 258"
        },
        "-1212955775": {
            "year": 661,
            "desc": "Caliph Ali ibn Abi Talib is assassinated. His successor Hasan ibn Ali abdicated the Caliphate to Muawiyah I, marking the beginning of the Umayyad caliphate."
        },
        "-289274013": {
            "year": 635,
            "desc": "Alopen, a Persian Christian priest introduces Nestorian Christianity into China."
        },
        "87144550": {
            "year": 525,
            "desc": "Having settled in Rome c. 500, Scythian monk Dionysius Exiguus invents the Anno Domini era calendar based on the estimated birth year of Jesus Christ."
        },
        "823036394": {
            "year": 642,
            "desc": "Library of Alexandria destroyed for the second time."
        },
        "-1313858594": {
            "year": 451,
            "desc": "The Huns under Attila facing the Romans and the Visigoths are defeated in the Battle of Chalons."
        },
        "-76265142": {
            "year": 622,
            "desc": "Year one of the Islamic calendar begins, during which the Hijra occurs\\u2014Muhammad and his followers emigrate from Mecca to Medina in September."
        },
        "-682739070": {
            "year": 664,
            "desc": "Conquest of Kabul by Muslims."
        },
        "754577406": {
            "year": 700,
            "desc": "Wet-field rice cultivation, small towns and kingdoms flourish. Trade links are established with China and India."
        },
        "-1424978702": {
            "year": 750,
            "desc": "The Ghana Empire begins in western Africa."
        },
        "1579758111": {
            "year": 440,
            "desc": "At some point after this date, the Anglo-Saxons settle in Britain. The traditional story is that they were invited there by Vortigern."
        },
        "634598747": {
            "year": 589,
            "desc": "China reunified under the Sui Dynasty (589 )."
        },
        "-1487424817": {
            "year": 469,
            "desc": "Death of Dengizich, last Khan of the Hun Empire."
        },
        "265870044": {
            "year": 40,
            "desc": "Emperor Caligula plans to invade Britain, but forgets to bring an army, he instead declares war upon the sea, whipping it and taking shells as prisoners."
        },
        "-1555867329": {
            "year": 411,
            "desc": "Suebi establish the first independent Christian kingdom of Western Europe in Gallaecia."
        },
        "1402697683": {
            "year": 554,
            "desc": "Eviction of the Ostrogoths from Rome, and the re-unification of all Italy under Byzantine rule."
        },
        "69437865": {
            "year": 787,
            "desc": "The Empress Irene of Athens convenes the Seventh Ecumenical Council, ending the first phase of Byzantine Iconoclasm."
        },
        "462610450": {
            "year": 14,
            "desc": "Augustus Caesar, first emperor of Rome, dies."
        },
        "1481325208": {
            "year": 691,
            "desc": "Buddhism is made the state religion of China"
        },
        "1344102921": {
            "year": 87,
            "desc": "The spread of the Roman Empire reaches its largest size under Trajan."
        },
        "864641786": {
            "year": 623,
            "desc": "The Frankish merchant Samo, supporting the Slavs fighting their Avar rulers, becomes the ruler of the first known Slav state in Central Europe."
        },
        "-302326749": {
            "year": 518,
            "desc": "Eastern Roman Emperor Anastasius I dies and is succeeded by Justin I."
        },
        "-1063994342": {
            "year": 700,
            "desc": "The Mount Edziza volcanic complex erupts in northern British Columbia, Canada."
        },
        "69310098": {
            "year": 793,
            "desc": "The first written account of a Viking raid carried out on the abbey of Lindisfarne in northern England."
        },
        "-170386281": {
            "year": 301,
            "desc": "Armenia first to adopt Christianity as state religion."
        },
        "813853451": {
            "year": 502,
            "desc": "Chinese annals mentioned the existence of the Buddhist Kingdom, Kanto Lim in South Sumatra, presumably in the neighborhood of present-day Palembang."
        },
        "-81183845": {
            "year": 610,
            "desc": "Heraclius arrives by ship from Africa at Constantinople, overthrows East Roman Emperor Phocas and becomes Emperor. His first major act is to change the official language of the East Roman Empire from Latin to Greek"
        },
        "-1451645773": {
            "year": 585,
            "desc": "Suebian Kingdom conquered by Visigoths in Spain."
        },
        "-1035420774": {
            "year": 407,
            "desc": "Constantine III leads many of the Roman military units from Britain to Gaul and occupies Arles (Arelate). This is generally seen as Rome's withdrawal from Britain."
        },
        "-1057133056": {
            "year": 127,
            "desc": "Kanishka, Kushan Ruler."
        },
        "4061444": {
            "year": 160,
            "desc": "Huvishka, Kushan ruler."
        },
        "637985442": {
            "year": 499,
            "desc": "African and Indonesian settlers reach Madagascar."
        },
        "-1078148004": {
            "year": 480,
            "desc": "Assassination of Julius Nepos, the last de jure Emperor of the Western Roman Empire, in Dalmatia."
        },
        "858772808": {
            "year": 731,
            "desc": "Bede completes his Historia ecclesiastica gentis Anglorum (Ecclesiastical History of the English People)."
        },
        "-1714708323": {
            "year": 688,
            "desc": "Emperor Justinian II of the Byzantine Empire defeats the Bulgarians."
        },
        "-1018137529": {
            "year": 641,
            "desc": "The Coptic period, in its more specific definition, ends when Islam is introduced into Egypt."
        },
        "1088376028": {
            "year": 494,
            "desc": "Northern Gaul is united under the Frankish King Clovis I, founder of the Merovingian dynasty."
        },
        "232118745": {
            "year": 535,
            "desc": "Postulated volcanic eruption in the tropics which causes several years of abnormally cold weather, resulting in mass famine in the Northern Hemisphere. (See Extreme weather events of 535-536.)"
        },
        "1653599466": {
            "year": 568,
            "desc": "Lombards invade Italy and establish a federation of dukedoms under a king."
        },
        "1264104936": {
            "year": 491,
            "desc": "King Clovis I defeats and subjugates the Kingdom of Thuringia in Germany."
        },
        "-1760788155": {
            "year": 680,
            "desc": "Decisive victory of the Bulgars over the Byzantines in the Battle of Ongal."
        },
        "1859298020": {
            "year": 9,
            "desc": "Three Roman legions were ambushed and destroyed at Teutoberg Forest by Germanic warriors under the leadership of Arminius."
        },
        "1543409229": {
            "year": 250,
            "desc": "Buddhism reaches China."
        },
        "1335642430": {
            "year": 781,
            "desc": "Nestorian (Christian) Monument is erected in China."
        },
        "-1089696960": {
            "year": 529,
            "desc": "Saint Benedict of Nursia founds the monastery of Monte Cassino in Italy."
        },
        "1307241325": {
            "year": 651,
            "desc": "Emperor Yazdgerd III is murdered in Merv, ending the rule of Sassanid dynasty in Persia (Iran)."
        },
        "-379107360": {
            "year": 717,
            "desc": "Siege of Constantinople. The Bulgarians and the Byzantines decisively defeat the invading Arabs, thus halting the Arab advance toward Europe."
        },
        "-90976579": {
            "year": 690,
            "desc": "Pro-Buddhist imperial consort Wu Zetian seizes power and rules as Empress of China"
        },
        "277442928": {
            "year": 325,
            "desc": "Constantine the Great calls the First Council of Nicaea to pacify Christianity in the grip of the Arian controversy."
        },
        "-952436377": {
            "year": 378,
            "desc": "Battle of Adrianople"
        },
        "968495709": {
            "year": 524,
            "desc": "Boethius writes his Consolation of Philosophy."
        },
        "-169537788": {
            "year": 527,
            "desc": "Justinian I succeeds Justin I as Emperor of the Eastern Roman Empire."
        },
        "-1045240957": {
            "year": 677,
            "desc": "Most of the Arab fleet is destroyed by Greek fire; the Persian crown prince flees to the T'ang court (in China)."
        },
        "-497742537": {
            "year": 751,
            "desc": "Arabian armies defeat Chinese Tang Dynasty troops in the Battle of Talas, in the high Pamirs near Samarkand, and conquer Central Asia completely."
        },
        "-2015354312": {
            "year": 220,
            "desc": "The Han Dynasty comes to an end with establishment of the Three Kingdoms in ancient China."
        },
        "-558640771": {
            "year": 7,
            "desc": "Prince Cunobeline of Catuvellauni defeats the Trinovantes in England and establishes his capital at Camulodunum (modern-day Colchester)."
        },
        "-1683481626": {
            "year": 9,
            "desc": "Prince Cunobeline is crowned King of Catuvellauni, his Kingdom dominates Southern England."
        },
        "466529493": {
            "year": 615,
            "desc": "The Sassanid Empire under Shah Khosrau II sacks Jerusalem, taking away the relic of the True cross."
        },
        "-2028315412": {
            "year": 212,
            "desc": "Constitutio Antoniniana grants citizenship to all free Roman men."
        },
        "548683469": {
            "year": 600,
            "desc": "At approximately this time, the world's population shrinks to about 208 million people."
        },
        "-1234194163": {
            "year": 265,
            "desc": "The Jin Dynasty is founded after the overthrow of the Cao Wei Dynasty by Sima Yan."
        },
        "1826812165": {
            "year": 481,
            "desc": "Clovis I becomes King of the Western Franks upon the death of Childeric I."
        },
        "-394478404": {
            "year": 732,
            "desc": "Battle of Tours. Near Poitiers, France, leader of the Franks Charles Martel and his men defeat a large army of Moors under the governor of Cordoba, Abdul Rahman Al Ghafiqi, who is killed during the battle. The Battle of Tours halts the advance of Islam into Western Europe and establishes a balance of power between Western Europe, Islam and the Byzantine Empire."
        },
        "-1161471891": {
            "year": 142,
            "desc": "The Antonine Wall is built across central Scotland. 144"
        },
        "1642107239": {
            "year": 193,
            "desc": "Roman Year of the Five Emperors."
        },
        "-719226293": {
            "year": 674,
            "desc": "The first Arab siege of Constantinople begins."
        },
        "-1636054454": {
            "year": 452,
            "desc": "Pope Leo I meets in person with Attila on the Mincio River and convinces him not to destroy Rome."
        },
        "-1910102160": {
            "year": 378,
            "desc": "Theodosius I, Roman emperor, bans pagan worship, Christianity is made the official religion of the Empire."
        },
        "67344742": {
            "year": 101,
            "desc": "The Dacian Wars. After two conflicts, Dacia is annexed as a Roman province."
        },
        "286576205": {
            "year": 792,
            "desc": "Battle of Marcelae. The Bulgarian victory over the Byzantines marks the end of the half-century political instability in Bulgaria."
        },
        "1874078652": {
            "year": 376,
            "desc": "Visigoths appear on the Danube and are allowed entry into the Roman Empire in their flight from the Huns."
        },
        "778549021": {
            "year": 632,
            "desc": "The Muslim conquests begin."
        },
        "-1702351730": {
            "year": 244,
            "desc": "Battle of Xingshi in China."
        },
        "-1565289055": {
            "year": 682,
            "desc": "Revival of the Turkic Khaganate by the efforts of Ilterish Qaghan and Tonyukuk"
        },
        "88191092": {
            "year": 656,
            "desc": "The First Islamic tribal war."
        },
        "-1762424925": {
            "year": 618,
            "desc": "Tang Dynasty of China initiated by Li Yuan."
        },
        "1587779370": {
            "year": 475,
            "desc": "Romulus Augustus, the last Western Roman Emperor begins his rule."
        },
        "-1553862434": {
            "year": 482,
            "desc": "This year,in the territory of modern Ukraine, Kiev was founded."
        },
        "570407600": {
            "year": 758,
            "desc": "Arab and Persian pirates and travelers burn and loot the Chinese city of Guangzhou, while the Tang Dynasty authorities shut the port down for the next five decades."
        },
        "856235921": {
            "year": 455,
            "desc": "The city of Chichen Itza is found in Mexico."
        },
        "1234036562": {
            "year": 493,
            "desc": "Theodoric the Great ousts Odoacer to become king of the Italian peninsular."
        },
        "-1298052699": {
            "year": 337,
            "desc": "Constantine the Great is baptized on his death bed."
        },
        "1604293469": {
            "year": 638,
            "desc": "Emperor Taizong (627-649) issues an edict of universal toleration of religions; Nestorian Christians build a church in Chang'an."
        },
        "1249396999": {
            "year": 33,
            "desc": "The Crucifixion of Jesus (traditional date)"
        },
        "-644512305": {
            "year": 541,
            "desc": "First pandemic of bubonic plague (Plague of Justinian) hits Constantinople and the rest of Byzantine Empire. In the plague eventually killed between 25 and 50 million people."
        },
        "414492165": {
            "year": 263,
            "desc": "Cao Wei conquers the Shu Han Kingdom."
        },
        "-558243826": {
            "year": 80,
            "desc": "The Colosseum is finished."
        },
        "-537188899": {
            "year": 563,
            "desc": "The monastery on Iona is founded by St. Columba."
        },
        "-940854892": {
            "year": 43,
            "desc": "Roman conquest of Britain begins. London is founded (although it could have existed centuries before this date)."
        },
        "1800554081": {
            "year": 793,
            "desc": "The Frisian-Frankish wars come to an end with the last uprising of the Frisians."
        },
        "-1812919193": {
            "year": 615,
            "desc": "Pacal the Great becomes king of the Mayan city-state of Palenque"
        },
        "-1110634696": {
            "year": 120,
            "desc": "Hadrian's Wall across Northern England."
        },
        "1979425725": {
            "year": 350,
            "desc": "About this time the Huns begin to invade the Sassanid (Persian) Empire."
        },
        "-1992523155": {
            "year": 670,
            "desc": "In 670 an Arab Muslim army under Uqba ibn Nafi entered the region of Ifriqiya. In the late 670s conquest of North Africa was completed."
        },
        "-1521879594": {
            "year": 60,
            "desc": "Queen Boudica of The Iceni in England launches a rebellion against The Romans. Tens of thousands die and the Roman army is massively damaged. The Rebellion fails and Boadicea commits suicide by poisoning herself. Three major cities are obliterated."
        },
        "-976578153": {
            "year": 603,
            "desc": "Last mention of the Roman Senate in Gregorian Register. It mentions that the senate acclaimed the statues of emperor Phocas and empress Leontia."
        },
        "-324601300": {
            "year": 636,
            "desc": "Around this time the Battle of al-Q\\u0101disiyyah resulted in a decisive victory for Muslims in the Islamic conquest of Persia, the Persian Empire is conquered by Muslim Arabs led by Sad Ibn Abi Waqqas."
        },
        "-936505955": {
            "year": 698,
            "desc": "North South States Period begins in Korea."
        },
        "-206163952": {
            "year": 794,
            "desc": "Emperor Kanmu moves the capital to Heian-kyo (present day Kyoto), initiating the Heian period of Japan."
        },
        "-1159869777": {
            "year": 589,
            "desc": "Third Council of Toledo adds the \\\"filioque\\\" clause to the Nicene Creed in Spain."
        },
        "-172041011": {
            "year": 732,
            "desc": "The Sanjaya dynasty is founded around this time according to the Canggal inscription."
        },
        "920587386": {
            "year": 595,
            "desc": "Pope Gregory sends Roman monks led by Augustine to England."
        },
        "1189782069": {
            "year": 574,
            "desc": "The Byzantine empire is invaded by various Slavs, the Balkans are plundered by the Slavs."
        },
        "-394791183": {
            "year": 711,
            "desc": "Tariq ibn Ziyad crosses the Straits of Gibraltar."
        },
        "915799703": {
            "year": 698,
            "desc": "The Arabs capture Carthage from the Byzantine Empire."
        },
        "496313203": {
            "year": 507,
            "desc": "Battle of Vouillé"
        },
        "-1349345608": {
            "year": 476,
            "desc": "Romulus Augustulus is removed as emperor by Odoacer"
        }
    }
}
